kza59/STM32--DHT20/LedWave1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define E_LCD_Pin GPIO_PIN_0
#define E_LCD_GPIO_Port GPIOA
#define LCD_R_W_Pin GPIO_PIN_1
#define LCD_R_W_GPIO_Port GPIOA
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define RS_Pin GPIO_PIN_4
#define RS_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define LCD0_Pin GPIO_PIN_6
#define LCD0_GPIO_Port GPIOA
#define LCD1_Pin GPIO_PIN_7
#define LCD1_GPIO_Port GPIOA
#define LCD2_Pin GPIO_PIN_4
#define LCD2_GPIO_Port GPIOC
#define LCD3_Pin GPIO_PIN_5
#define LCD3_GPIO_Port GPIOC
#define LCD4_Pin GPIO_PIN_0
#define LCD4_GPIO_Port GPIOB
#define LCD5_Pin GPIO_PIN_1
#define LCD5_GPIO_Port GPIOB
#define LCD6_Pin GPIO_PIN_2
#define LCD6_GPIO_Port GPIOB
#define LCD7_Pin GPIO_PIN_10
#define LCD7_GPIO_Port GPIOB
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define DHT20_EN_Pin GPIO_PIN_9
#define DHT20_EN_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
